<!DOCTYPE html>
<html>

<head>
	<title>Lets Code</title>

	<!-- Theme -->
	<link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css" integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z" crossorigin="anonymous">
	<link rel="stylesheet" href="css/main.css">
	<!-- Script -->
	<script src="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/js/bootstrap.min.js" integrity="sha384-B4gt1jrGC7Jh4AgTPSdUtOBvfO8shuf57BaghqFfPlYxofvL8/KUEfYiJOMMV+rV" crossorigin="anonymous"></script>

<meta name="viewport" content="width=device-width, initial-scale=1.0">
<style>

.rod::after {
  content: "";
  clear: both;
  display: block;
}

[class*="cod-"] {
  float: left;
  padding: 10px;
}

/* For desktop: */
.cod-1 {width: 8.33%;}
.cod-2 {width: 16.66%;}
.cod-3 {width: 25% !important;min-width: 250px !important;}
.cod-4 {width: 33.33%;}
.cod-5 {width: 41.66%;}
.cod-6 {width: 50%;}
.cod-7 {width: 58.33%;}
.cod-8 {width: 66.66% !important;flex: 0 0 73% !important;}
.cod-9 {max-width: 75%;}
.cod-10 {width: 83.33%;}
.cod-11 {width: 91.66%;}
.cod-12 {width: 100%;}
</style>

</head>

<body>
	<nav class="navbar navbar-expand-lg navbar-dark bg-dark">
		<ul class="navbar navbar-expand-lg navbar-dark bg-dark">
				<li onclick="window.location='Startseite.html'">
					Startseite
					<span></span><span></span><span></span><span></span>
				</li>
				<li onclick="window.location='subpages/LearnC.html'">
					Learn C#
					<span></span><span></span><span></span><span></span>
				</li>
			</ul>
		</nav>
	</div>
	<div id="bild">
		<div id="wrap">
			
			<div id="grad">
				<div id="content">

					<div class="beitragform">
						<h1>Beschreibung</h1>
						<p>Wolltest du schon immer ein Rollenspiel schreiben, aber wei&szlig;t nicht wie man programmiert?</p>
						<p>Hast du Interesse daran, dir spielerisch ein Basiswissen in C# aufzubauen?</p>
						<p>Dann bist du hier richtig!
						Diese Lektionen werden dich vom kompletten Anf&auml;nger zum Autor eines Rollenspiels machen.
						Es wird am Ende der Lektionen nicht das komplizierteste Spiel sein, aber w&auml;hrend du es erstellst, lernst du genug Werkzeuge kennen, um dein Spiel zu erweitern. Das Ende der Lektionen ist nicht das Ende des Spiels! Wenn es dir Spa&szlig; gemacht hat, kannst du es jederzeit verbessern, indem du weitere Funktionen hinzuf&uuml;gst und ihm deine eigene Note gibst.
						Unser Code liegt als Referenz auch am Ende der Lektionen zum Download bereit.</p>
					</div>

					<div class="beitragform">
						<h1>About</h1>
						<p>Wir sind ein junges Entwicklerteam aus Wien, das mit dem Willen, simple L&ouml;sungen f&uuml;r simple Anliegen zu finden, arbeitet.
						Mit Spa&szlig; an der Sache, egal ob C#, Java, JavaScript oder PHP. Unsere Projekte sollen euch helfen mit uns an der Welt des Programmierens teilzunehmen.
						F&uuml;r R&uuml;ckmeldungen stehen wir gerne zur Verf&uuml;gung. </p>
						<p>Worauf wartest du noch? </p>
						<p>Auf los geht's los!</p>
					</div>

					<div class="beitragform">
						<h1>Wie benutzt man diese Seite?</h1>
						<p>Hier erf&auml;hrst du, wie die Webseite aufgebaut ist.</p>
						<div class="pb">
							<img src="img/Anleitung.jpg" alt="abc" class="irgendwas">
							</img>
						</div>
						<p>
							1. Hier kannst du zwischen der Startseite und der Lernseite hin- und herwechseln (in sp&auml;teren Versionen kannst du auch zwischen verschiedenen Programmiersprachen w&auml;hlen).</p>
						<p>
							2. Hier findest du die einzelnen Lektionen auf der Webseite, sie sind in verschiedene Level unterteilt. Wir raten dir mit Level 1 anzufangen, weil die Kapitel/Level aufeinander aufgebaut sind.
						</p>
						<p>
							3. Jedes Level ist aufgeteilt zwischen einem Theorieteil und einen Programmierteil. Die Konsole zum Programmieren wird schwarz dargestellt.
						</p>
						<p>
							4. Dieser Button wird ben&ouml;tigt zum Ausf&uuml;hren des Codes. Nach dr&uuml;cken des Buttons erscheint ein Fenster, das dir dann anzeigt, ob du die Aufgabe geschafft hast, oder nicht.
						</p>
						<p>
							5. Hier ist die Konsole in der du programmieren wirst. In jedem Level ist eine Konsole schon mit Code vorbereitet, den du dann ver&auml;ndern und erweitern darfst.

							<span style="font-weight: bold">Durch das dr&uuml;cken der F11 Taste, ist es m&ouml;glich in den Vollbildmodus der Konsole zu wechseln.</span>Daf&uuml; dr&uuml;cke mit deiner Maus in das Konsolenfeld, nun sollte sich mit der F11 Taste der Vollbildmodus der Konsole aktivieren.
						</p>
					</div>

					<div class="beitragform">
						<!-- Infos ueber uns -->
						<div class="beitragform">
							<h1>Kontakt</h1>
							<h3>Teamleiter</h3>
							&nbsp;Lukas Feichtinger<br />
							&nbsp;E-Mail: <a href="mailto:wi17b061@technikum-wien.at" id="mail">wi17b061@technikum-wien.at</a><br /><br />
							<h3>Teammitglied</h3>
							&nbsp;Alexander Rathbauer<br />
							&nbsp;E-Mail: <a href="mailto:wi17b109@technikum-wien.at" id="mail">wi17b109@technikum-wien.at</a><br /><br />
							<h3>Teammitglied</h3>
							&nbsp;Saskia Huemer<br />
							&nbsp;E-Mail: <a href="mailto:wi18b092@technikum-wien.at" id="mail">wi18b092@technikum-wien.at</a><br /><br />
							<h3>Teammitglied</h3>
							&nbsp;Hui-Qing An Rinbnicsek<br />
							&nbsp;E-Mail: <a href="mailto:wi17b115@technikum-wien.at" id="mail">wi17b115@technikum-wien.at</a><br /><br />
						</div>
					</div>
					<!--Ende Contend -->
				</div>
			</div>
	</div>
</div>
</body>

</html>
